{"modelTopology":{"node":[{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator/in13_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"generator/deconv02_1/conv2d_transpose/output_shape/3","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator/deconv02_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator/in12_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":3}},"name":"generator/deconv02_1/strided_slice/stack","op":"Const"},{"input":[],"attr":{"dtype":{"type":3},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}}},"name":"generator/deconv02_1/strided_slice_1/stack_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":3}},"name":"generator/deconv02_1/strided_slice_2/stack_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":3}},"name":"generator/deconv02_1/strided_slice/stack_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"generator/deconv02_1/mul/y","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"generator/deconv02_1/add/y","op":"Const"},{"input":[],"attr":{"dtype":{"type":3},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}}},"name":"generator/deconv01_1/conv2d_transpose/output_shape/3","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"256"}]}}}},"name":"generator/deconv01_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in11_2/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in11_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv11_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv11_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in11_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv11_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv11_2/bias","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}}},"name":"generator/in11_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in10_2/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in10_1/beta","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}}},"name":"generator/conv10_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv10_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in10_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv10_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv10_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in10_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in09_2/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in09_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv09_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv09_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in09_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv09_2/kernel","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}}},"name":"generator/conv09_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in09_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in08_2/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in08_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv08_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv08_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in08_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv08_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv08_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in08_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in07_2/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in07_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv07_1/kernel","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}}},"name":"generator/conv07_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in07_1/gamma","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}}},"name":"generator/conv07_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv07_2/bias","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}}},"name":"generator/in07_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in06_2/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in06_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv06_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv06_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in06_1/gamma","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}}},"name":"generator/conv06_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv06_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in06_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in05_2/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in05_1/beta","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}}},"name":"generator/conv05_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv05_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in05_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv05_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv05_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in05_2/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in04_2/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in04_1/beta","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}}},"name":"generator/conv04_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv04_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in04_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv04_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv04_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in04_2/gamma","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}}},"name":"generator/in03_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator/in02_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator/in01_1/beta","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"7"},{"size":"7"},{"size":"3"},{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator/conv01_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator/conv01_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator/in01_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator/conv02_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator/conv02_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator/conv02_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator/conv02_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator/in02_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv03_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv03_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/conv03_2/kernel","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}}},"name":"generator/conv03_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"generator/in03_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator/deconv01_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator/deconv01_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator/deconv01_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"generator/in12_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":3}},"name":"generator/deconv01_1/strided_slice_3/stack","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"3"}]}}},"dtype":{"type":3}},"name":"generator/deconv01_1/strided_slice_3/stack_1","op":"Const"},{"input":[],"attr":{"dtype":{"type":3},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"3"}]}}}},"name":"generator/deconv01_1/strided_slice_3/stack_2","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator/deconv02_1/bias","op":"Const"},{"input":[],"attr":{"dtype":{"type":3},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}},"name":"generator/Pad_15/paddings","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator/deconv02_2/kernel","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}}},"name":"generator/deconv02_2/bias","op":"Const"},{"input":[],"attr":{"dtype":{"type":3},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"2"}]}}}},"name":"generator/in11_1/moments/mean/reduction_indices","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[]}}},"dtype":{"type":1}},"name":"generator/in11_1/instancenorm/add/y","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"generator/in13_1/gamma","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":3}},"name":"generator/Pad/paddings","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"7"},{"size":"7"},{"size":"64"},{"size":"3"}]}}},"dtype":{"type":1}},"name":"generator/deconv03_1/kernel","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"}]}}}},"name":"generator/deconv03_1/bias","op":"Const"},{"input":[],"attr":{"shape":{"shape":{"dim":[{"size":"1"},{"size":"-1"},{"size":"-1"},{"size":"3"}]}},"dtype":{"type":1}},"name":"input","op":"Placeholder"},{"input":["input","generator/Pad/paddings"],"attr":{"Tpaddings":{"type":3},"T":{"type":1}},"name":"generator/Pad","op":"Pad"},{"input":["generator/Pad","generator/conv01_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"generator/conv01_1/Conv2D","op":"Conv2D"},{"input":["generator/conv01_1/Conv2D","generator/conv01_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"generator/conv01_1/BiasAdd","op":"BiasAdd"},{"input":["generator/conv01_1/BiasAdd","generator/in11_1/moments/mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"generator/in01_1/moments/mean","op":"Mean"},{"input":["generator/conv01_1/BiasAdd","generator/in01_1/moments/mean"],"attr":{"T":{"type":1}},"name":"generator/in01_1/moments/SquaredDifference","op":"SquaredDifference"},{"input":["generator/in01_1/moments/SquaredDifference","generator/in11_1/moments/mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"generator/in01_1/moments/variance","op":"Mean"},{"input":["generator/in01_1/moments/variance","generator/in11_1/instancenorm/add/y"],"attr":{"T":{"type":1}},"name":"generator/in01_1/instancenorm/add","op":"Add"},{"input":["generator/in01_1/instancenorm/add"],"attr":{"T":{"type":1}},"name":"generator/in01_1/instancenorm/Rsqrt","op":"Rsqrt"},{"input":["generator/in01_1/instancenorm/Rsqrt","generator/in01_1/gamma"],"attr":{"T":{"type":1}},"name":"generator/in01_1/instancenorm/mul","op":"Mul"},{"input":["generator/conv01_1/BiasAdd","generator/in01_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator/in01_1/instancenorm/mul_1","op":"Mul"},{"input":["generator/in01_1/moments/mean","generator/in01_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator/in01_1/instancenorm/mul_2","op":"Mul"},{"input":["generator/in01_1/beta","generator/in01_1/instancenorm/mul_2"],"attr":{"T":{"type":1}},"name":"generator/in01_1/instancenorm/sub","op":"Sub"},{"input":["generator/in01_1/instancenorm/mul_1","generator/in01_1/instancenorm/sub"],"attr":{"T":{"type":1}},"name":"generator/in01_1/instancenorm/add_1","op":"Add"},{"input":["generator/in01_1/instancenorm/add_1"],"attr":{"T":{"type":1}},"name":"generator/Relu","op":"Relu"},{"input":["generator/Relu","generator/Pad_15/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"generator/conv02_1/Pad","op":"Pad"},{"input":["generator/conv02_1/Pad","generator/conv02_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"generator/conv02_1/Conv2D","op":"Conv2D"},{"input":["generator/conv02_1/Conv2D","generator/conv02_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"generator/conv02_1/BiasAdd","op":"BiasAdd"},{"input":["generator/conv02_1/BiasAdd","generator/Pad_15/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"generator/conv02_2/Pad","op":"Pad"},{"input":["generator/conv02_2/Pad","generator/conv02_2/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"generator/conv02_2/Conv2D","op":"Conv2D"},{"input":["generator/conv02_2/Conv2D","generator/conv02_2/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"generator/conv02_2/BiasAdd","op":"BiasAdd"},{"input":["generator/conv02_2/BiasAdd","generator/in11_1/moments/mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"generator/in02_1/moments/mean","op":"Mean"},{"input":["generator/conv02_2/BiasAdd","generator/in02_1/moments/mean"],"attr":{"T":{"type":1}},"name":"generator/in02_1/moments/SquaredDifference","op":"SquaredDifference"},{"input":["generator/in02_1/moments/SquaredDifference","generator/in11_1/moments/mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"generator/in02_1/moments/variance","op":"Mean"},{"input":["generator/in02_1/moments/variance","generator/in11_1/instancenorm/add/y"],"attr":{"T":{"type":1}},"name":"generator/in02_1/instancenorm/add","op":"Add"},{"input":["generator/in02_1/instancenorm/add"],"attr":{"T":{"type":1}},"name":"generator/in02_1/instancenorm/Rsqrt","op":"Rsqrt"},{"input":["generator/in02_1/instancenorm/Rsqrt","generator/in02_1/gamma"],"attr":{"T":{"type":1}},"name":"generator/in02_1/instancenorm/mul","op":"Mul"},{"input":["generator/conv02_2/BiasAdd","generator/in02_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator/in02_1/instancenorm/mul_1","op":"Mul"},{"input":["generator/in02_1/moments/mean","generator/in02_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator/in02_1/instancenorm/mul_2","op":"Mul"},{"input":["generator/in02_1/beta","generator/in02_1/instancenorm/mul_2"],"attr":{"T":{"type":1}},"name":"generator/in02_1/instancenorm/sub","op":"Sub"},{"input":["generator/in02_1/instancenorm/mul_1","generator/in02_1/instancenorm/sub"],"attr":{"T":{"type":1}},"name":"generator/in02_1/instancenorm/add_1","op":"Add"},{"input":["generator/in02_1/instancenorm/add_1"],"attr":{"T":{"type":1}},"name":"generator/Relu_1","op":"Relu"},{"input":["generator/Relu_1","generator/Pad_15/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"generator/conv03_1/Pad","op":"Pad"},{"input":["generator/conv03_1/Pad","generator/conv03_1/kernel"],"attr":{"padding":{"s":[86,65,76,73,68]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true}},"name":"generator/conv03_1/Conv2D","op":"Conv2D"},{"input":["generator/conv03_1/Conv2D","generator/conv03_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"generator/conv03_1/BiasAdd","op":"BiasAdd"},{"input":["generator/conv03_1/BiasAdd","generator/Pad_15/paddings"],"attr":{"Tpaddings":{"type":3},"T":{"type":1}},"name":"generator/conv03_2/Pad","op":"Pad"},{"input":["generator/conv03_2/Pad","generator/conv03_2/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"generator/conv03_2/Conv2D","op":"Conv2D"},{"input":["generator/conv03_2/Conv2D","generator/conv03_2/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"generator/conv03_2/BiasAdd","op":"BiasAdd"},{"input":["generator/conv03_2/BiasAdd","generator/in11_1/moments/mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"generator/in03_1/moments/mean","op":"Mean"},{"input":["generator/conv03_2/BiasAdd","generator/in03_1/moments/mean"],"attr":{"T":{"type":1}},"name":"generator/in03_1/moments/SquaredDifference","op":"SquaredDifference"},{"input":["generator/in03_1/moments/SquaredDifference","generator/in11_1/moments/mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"generator/in03_1/moments/variance","op":"Mean"},{"input":["generator/in03_1/moments/variance","generator/in11_1/instancenorm/add/y"],"attr":{"T":{"type":1}},"name":"generator/in03_1/instancenorm/add","op":"Add"},{"input":["generator/in03_1/instancenorm/add"],"attr":{"T":{"type":1}},"name":"generator/in03_1/instancenorm/Rsqrt","op":"Rsqrt"},{"input":["generator/in03_1/instancenorm/Rsqrt","generator/in03_1/gamma"],"attr":{"T":{"type":1}},"name":"generator/in03_1/instancenorm/mul","op":"Mul"},{"input":["generator/conv03_2/BiasAdd","generator/in03_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator/in03_1/instancenorm/mul_1","op":"Mul"},{"input":["generator/in03_1/moments/mean","generator/in03_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator/in03_1/instancenorm/mul_2","op":"Mul"},{"input":["generator/in03_1/beta","generator/in03_1/instancenorm/mul_2"],"attr":{"T":{"type":1}},"name":"generator/in03_1/instancenorm/sub","op":"Sub"},{"input":["generator/in03_1/instancenorm/mul_1","generator/in03_1/instancenorm/sub"],"attr":{"T":{"type":1}},"name":"generator/in03_1/instancenorm/add_1","op":"Add"},{"input":["generator/in03_1/instancenorm/add_1"],"attr":{"T":{"type":1}},"name":"generator/Relu_2","op":"Relu"},{"input":["generator/Relu_2","generator/Pad_15/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"generator/Pad_1","op":"Pad"},{"input":["generator/Pad_1","generator/conv04_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"generator/conv04_1/Conv2D","op":"Conv2D"},{"input":["generator/conv04_1/Conv2D","generator/conv04_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"generator/conv04_1/BiasAdd","op":"BiasAdd"},{"input":["generator/conv04_1/BiasAdd","generator/in11_1/moments/mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"generator/in04_1/moments/mean","op":"Mean"},{"input":["generator/conv04_1/BiasAdd","generator/in04_1/moments/mean"],"attr":{"T":{"type":1}},"name":"generator/in04_1/moments/SquaredDifference","op":"SquaredDifference"},{"input":["generator/in04_1/moments/SquaredDifference","generator/in11_1/moments/mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"generator/in04_1/moments/variance","op":"Mean"},{"input":["generator/in04_1/moments/variance","generator/in11_1/instancenorm/add/y"],"attr":{"T":{"type":1}},"name":"generator/in04_1/instancenorm/add","op":"Add"},{"input":["generator/in04_1/instancenorm/add"],"attr":{"T":{"type":1}},"name":"generator/in04_1/instancenorm/Rsqrt","op":"Rsqrt"},{"input":["generator/in04_1/instancenorm/Rsqrt","generator/in04_1/gamma"],"attr":{"T":{"type":1}},"name":"generator/in04_1/instancenorm/mul","op":"Mul"},{"input":["generator/conv04_1/BiasAdd","generator/in04_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator/in04_1/instancenorm/mul_1","op":"Mul"},{"input":["generator/in04_1/moments/mean","generator/in04_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator/in04_1/instancenorm/mul_2","op":"Mul"},{"input":["generator/in04_1/beta","generator/in04_1/instancenorm/mul_2"],"attr":{"T":{"type":1}},"name":"generator/in04_1/instancenorm/sub","op":"Sub"},{"input":["generator/in04_1/instancenorm/mul_1","generator/in04_1/instancenorm/sub"],"attr":{"T":{"type":1}},"name":"generator/in04_1/instancenorm/add_1","op":"Add"},{"input":["generator/in04_1/instancenorm/add_1"],"attr":{"T":{"type":1}},"name":"generator/Relu_3","op":"Relu"},{"input":["generator/Relu_3","generator/Pad_15/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"generator/Pad_2","op":"Pad"},{"input":["generator/Pad_2","generator/conv04_2/kernel"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}}},"name":"generator/conv04_2/Conv2D","op":"Conv2D"},{"input":["generator/conv04_2/Conv2D","generator/conv04_2/bias"],"attr":{"data_format":{"s":[78,72,87,67]},"T":{"type":1}},"name":"generator/conv04_2/BiasAdd","op":"BiasAdd"},{"input":["generator/conv04_2/BiasAdd","generator/in11_1/moments/mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"generator/in04_2/moments/mean","op":"Mean"},{"input":["generator/conv04_2/BiasAdd","generator/in04_2/moments/mean"],"attr":{"T":{"type":1}},"name":"generator/in04_2/moments/SquaredDifference","op":"SquaredDifference"},{"input":["generator/in04_2/moments/SquaredDifference","generator/in11_1/moments/mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"generator/in04_2/moments/variance","op":"Mean"},{"input":["generator/in04_2/moments/variance","generator/in11_1/instancenorm/add/y"],"attr":{"T":{"type":1}},"name":"generator/in04_2/instancenorm/add","op":"Add"},{"input":["generator/in04_2/instancenorm/add"],"attr":{"T":{"type":1}},"name":"generator/in04_2/instancenorm/Rsqrt","op":"Rsqrt"},{"input":["generator/in04_2/instancenorm/Rsqrt","generator/in04_2/gamma"],"attr":{"T":{"type":1}},"name":"generator/in04_2/instancenorm/mul","op":"Mul"},{"input":["generator/conv04_2/BiasAdd","generator/in04_2/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator/in04_2/instancenorm/mul_1","op":"Mul"},{"input":["generator/in04_2/moments/mean","generator/in04_2/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator/in04_2/instancenorm/mul_2","op":"Mul"},{"input":["generator/in04_2/beta","generator/in04_2/instancenorm/mul_2"],"attr":{"T":{"type":1}},"name":"generator/in04_2/instancenorm/sub","op":"Sub"},{"input":["generator/in04_2/instancenorm/mul_1","generator/in04_2/instancenorm/sub"],"attr":{"T":{"type":1}},"name":"generator/in04_2/instancenorm/add_1","op":"Add"},{"input":["generator/in04_2/instancenorm/add_1","generator/Relu_2"],"attr":{"T":{"type":1}},"name":"generator/add","op":"Add"},{"input":["generator/add","generator/Pad_15/paddings"],"attr":{"Tpaddings":{"type":3},"T":{"type":1}},"name":"generator/Pad_3","op":"Pad"},{"input":["generator/Pad_3","generator/conv05_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"generator/conv05_1/Conv2D","op":"Conv2D"},{"input":["generator/conv05_1/Conv2D","generator/conv05_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"generator/conv05_1/BiasAdd","op":"BiasAdd"},{"input":["generator/conv05_1/BiasAdd","generator/in11_1/moments/mean/reduction_indices"],"attr":{"T":{"type":1},"keep_dims":{"b":true},"Tidx":{"type":3}},"name":"generator/in05_1/moments/mean","op":"Mean"},{"input":["generator/conv05_1/BiasAdd","generator/in05_1/moments/mean"],"attr":{"T":{"type":1}},"name":"generator/in05_1/moments/SquaredDifference","op":"SquaredDifference"},{"input":["generator/in05_1/moments/SquaredDifference","generator/in11_1/moments/mean/reduction_indices"],"attr":{"keep_dims":{"b":true},"Tidx":{"type":3},"T":{"type":1}},"name":"generator/in05_1/moments/variance","op":"Mean"},{"input":["generator/in05_1/moments/variance","generator/in11_1/instancenorm/add/y"],"attr":{"T":{"type":1}},"name":"generator/in05_1/instancenorm/add","op":"Add"},{"input":["generator/in05_1/instancenorm/add"],"attr":{"T":{"type":1}},"name":"generator/in05_1/instancenorm/Rsqrt","op":"Rsqrt"},{"input":["generator/in05_1/instancenorm/Rsqrt","generator/in05_1/gamma"],"attr":{"T":{"type":1}},"name":"generator/in05_1/instancenorm/mul","op":"Mul"},{"input":["generator/conv05_1/BiasAdd","generator/in05_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator/in05_1/instancenorm/mul_1","op":"Mul"},{"input":["generator/in05_1/moments/mean","generator/in05_1/instancenorm/mul"],"attr":{"T":{"type":1}},"name":"generator/in05_1/instancenorm/mul_2","op":"Mul"},{"input":["generator/in05_1/beta","generator/in05_1/instancenorm/mul_2"],"attr":{"T":{"type":1}},"name":"generator/in05_1/instancenorm/sub","op":"Sub"},{"input":["generator/in05_1/instancenorm/mul_1","generator/in05_1/instancenorm/sub"],"attr":{"T":{"type":1}},"name":"generator/in05_1/instancenorm/add_1","op":"Add"},{"input":["generator/in05_1/instancenorm/add_1"],"attr":{"T":{"type":1}},"name":"generator/Relu_4","op":"Relu"},{"input":["generator/Relu_4","generator/Pad_15/paddings"],"attr":{"Tpaddings":{"type":3},"T":{"type":1}},"name":"generator/Pad_4","op":"Pad"},{"input":["generator/Pad_4","generator/conv05_2/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},